In [111]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [112]:
transactions = pd.read_csv("transactions.csv")
merchants_train = pd.read_csv("merchants_train.csv")
merchants_test = pd.read_csv("merchants_test.csv")
credit_train = pd.read_csv("credit_train.csv",encoding='latin-1')
credit_test = pd.read_csv("credit_test.csv", encoding ="latin-1")

In [113]:
transactions.head()

   merchant_id   latitude  longitude real_transaction_dttm record_date
0          178   0.000000   0.000000               9:34:47     9:30:36
1          178  55.055996  82.912991              17:49:50    17:54:24
2          178   0.000000   0.000000               9:34:47     9:31:22
3          178  55.056034  82.912734              17:49:50    17:43:01
4          178  55.056034  82.912734              17:49:50    17:45:17

In [114]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249353 entries, 0 to 249352
Data columns (total 5 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   merchant_id            249353 non-null  int64
 1   latitude               249353 non-null  float64
 2   longitude              249353 non-null  float64
 3   real_transaction_dttm  249353 non-null  object
 4   record_date            249353 non-null  object
dtypes: float64(2), int64(1), object(2)
memory usage: 9.5+ MB

In [115]:
transactions.shape

(249353, 5)

In [116]:
transactions.isnull().sum()
# Data is Clean, doesn't contain any missing values

merchant_id              0
latitude                 0
longitude                0
real_transaction_dttm    0
record_date              0
dtype: int64

In [117]:
merchants_train.head()
merchants_train.columns
merchants_train.info()
merchants_train.shape
# Need to split the columns and the rows

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6482 entries, 0 to 6481
Data columns (total 1 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   merchant_id;latitude;longitude  6482 non-null   object
dtypes: object(1)
memory usage: 50.8+ KB

(6482, 1)

In [118]:
merchants_train_splitted = merchants_train["merchant_id;latitude;longitude"].str.split(";",expand=True)
#merchants_train_splitted.head()
# Splitted Columns and got three new columns with Wrong Names
# Have to change the name of the columns

In [119]:
#merchants_train_splitted.rename(columns={"0":"merchant_id","1":"latitude","2":"longitude"},inplace=True)
#merchants_train_splitted.head()
merchants_train_splitted.rename(columns ={0:"merchant_id", 1:"latitude", 2:"longitude"},inplace=True)
merchants_train_splitted
# Name of the Columns has been changed

     merchant_id   latitude  longitude
0            178  55.055553  82.911833
1            267  55.726877  37.579645
2            357  54.706402   20.47142
3            505  64.553811  40.551964
4            532  55.768355  49.217176
...          ...        ...        ...
6477     1786127  55.713755  37.889762
6478     1827295  55.656707   37.85577
6479     1834870  55.761685  37.658527
6480     1836812  55.761685  37.658527
6481     1869302  55.633221  37.624247

[6482 rows x 3 columns]

In [120]:
merchants_test.head()
merchants_test.info()
# Need to split to too

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3524 entries, 0 to 3523
Data columns (total 1 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   merchant_id;latitude;longitude  3524 non-null   object
dtypes: object(1)
memory usage: 27.7+ KB

In [121]:
# Splitting the data
merchants_test.head()
merchants_test_splitted = merchants_test["merchant_id;latitude;longitude"].str.split(";",expand=True)
merchants_test_splitted.head()

      0 1 2
0   361
1   428
2   490
3  1175
4  1239

In [122]:
# Splitted the data but last two rows are empty, probably have to merge the values
# from other datasets
# Change the name of the Columns
merchants_test_splitted.rename(columns={0:"merchant_id", 1:"latitude", 2:"longitude"}, inplace=True)
merchants_test_splitted.head()
# Names are changed and fixed!

  merchant_id latitude longitude
0         361
1         428
2         490
3        1175
4        1239

In [123]:
#credit_train = pd.read_csv("credit_train.csv")
#credit_train = pd.read_csv('credit_train.csv',encoding='latin-1')
credit_train.head()
# Fix the Data

                                 client_id;gender;age;marital_status;job_position;credit_sum;credit_month;tariff_id;score_shk;education;living_region;monthly_income;credit_count;overdue_credit_count;open_account_flg
1;M;48;MAR;UMN;59998 00;10;1.6;0          770249;GRD;ÊÐÀÑÍÎÄÀÐÑÊÈÉ ÊÐÀÉ;30000;1;1;0
2;F;28;MAR;UMN;10889 00;6;1.1;0                       248514;GRD;ÌÎÑÊÂÀ;43000;2;0;0
3;M;32;MAR;SPC;10728 00;12;1.1;0             459589;SCH;ÎÁË ÑÀÐÀÒÎÂÑÊÀß;23000;5;0;0
4;F;27;DIV;SPC;12009 09;12;1.1;0           362536;GRD;ÎÁË ÂÎËÃÎÃÐÀÄÑÊÀß;17000;2;0;0
5;M;45;MAR;SPC;16908 89;10;1.1;0         421385;SCH;×ÅËßÁÈÍÑÊÀß ÎÁËÀÑÒÜ;25000;1;0;0

In [124]:
credit_train.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 170746 entries, ('1;M;48;MAR;UMN;59998', '00;10;1.6;0') to ('170746;M;49;MAR;SPC;12787', '00;10;1.1;0')
Data columns (total 1 columns):
 #   Column                                                                                                                                                                                  Non-Null Count   Dtype
---  ------                                                                                                                                                                                  --------------   -----
 0   client_id;gender;age;marital_status;job_position;credit_sum;credit_month;tariff_id;score_shk;education;living_region;monthly_income;credit_count;overdue_credit_count;open_account_flg  170746 non-null  object
dtypes: object(1)
memory usage: 7.7+ MB

In [125]:
credit_train_splitted = credit_train["client_id;gender;age;marital_status;job_position;credit_sum;credit_month;tariff_id;score_shk;education;living_region;monthly_income;credit_count;overdue_credit_count;open_account_flg"].str.split(";",expand=True)
# Total must be 16 - Columns
# Total rows must be 17
#credit_train_splitted.head()
#credit_train_splitted[0].str.split(";",expand = True)
#credit_train_splitted.info()
credit_train_splitted.rename(columns={0:"client_id", 1:"gender", 2:"age", 3:"marital_status", 4:"job_position", 5:"credit_sum", 6:"credit_month"},inplace=True)
credit_train_splitted.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 170746 entries, ('1;M;48;MAR;UMN;59998', '00;10;1.6;0') to ('170746;M;49;MAR;SPC;12787', '00;10;1.1;0')
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   client_id       170746 non-null  object
 1   gender          170746 non-null  object
 2   age             170746 non-null  object
 3   marital_status  170746 non-null  object
 4   job_position    170746 non-null  object
 5   credit_sum      170746 non-null  object
 6   credit_month    170746 non-null  object
dtypes: object(7)
memory usage: 15.5+ MB

In [169]:
# Split the rows inside the data
from numpy import column_stack

credit_train_splitted["client_id"].head()
#credit_train_splitted[["client","client2","client3","client4","client5","client6","client7","client8","client9","client10","client11"]] = credit_train_splitted["client_id"].str.split(";", expand=True)

0    770249
1    248514
2    459589
3    362536
4    421385
Name: client_id, dtype: object

In [168]:

credit_train_splitted["client_id"].head(3)

0    770249
1    248514
2    459589
Name: client_id, dtype: object

In [170]:
credit_train_splitted["client_id"] = credit_train_splitted["client_id"].str.split(";",expand=True)
credit_train_splitted = credit_train_splitted.explode("client_id").reset_index(drop=True)
#cols = list(credit_train_splitted.columns)
#cols.append(cols.pop(cols.index("gender")))
#credit_train_splitted = credit_train_splitted[cols]
credit_train_splitted.head(3)

,client_id,age,marital_status,job_position,credit_sum,credit_month,gender
0,770249,ÊÐÀÑÍÎÄÀÐÑÊÈÉ ÊÐÀÉ,30000,1,1,0,GRD
1,248514,ÌÎÑÊÂÀ,43000,2,0,0,GRD
2,459589,ÎÁË ÑÀÐÀÒÎÂÑÊÀß,23000,5,0,0,SCH

In [127]:
credit_train_splitted.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 170746 entries, ('1;M;48;MAR;UMN;59998', '00;10;1.6;0') to ('170746;M;49;MAR;SPC;12787', '00;10;1.1;0')
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   client_id       170746 non-null  object
 1   gender          170746 non-null  object
 2   age             170746 non-null  object
 3   marital_status  170746 non-null  object
 4   job_position    170746 non-null  object
 5   credit_sum      170746 non-null  object
 6   credit_month    170746 non-null  object
dtypes: object(7)
memory usage: 15.5+ MB

In [128]:
#credit_test = pd.read_csv("credit_test.csv", encoding = "latin-1")
credit_test.head()
# Fix the Data

                                      client_id;gender;age;marital_status;job_position;credit_sum;credit_month;tariff_id;score_shk;education;living_region;monthly_income;credit_count;overdue_credit_count
170747;F;48;MAR;UMN;16558 00;10;1.1;0                  370409;GRD;ÕÀÊÀÑÈß ÐÅÑÏ;34000;2;0
170748;M;29;MAR;SPC;7028  72;6;1.4;0                377281;SCH;ÎÁË ÊÅÌÅÐÎÂÑÊÀß;19000;3;0
170749;F;20;UNM;SPC;13019 00;10;1.6;0              538515;SCH;ÎÁË ÁÅËÃÎÐÎÄÑÊÀß;25000;1;0
170750;F;41;MAR;SPC;9379  00;10;1.1;0                 482520;GRD;ÎÁË ÈÐÊÓÒÑÊÀß;30000;0;0
170751;F;31;MAR;SPC;13990 00;6;1.43;0                 485914;GRD;ÎÁË ÊÈÐÎÂÑÊÀß;20000;2;0

In [172]:
credit_test.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 91940 entries, ('170747;F;48;MAR;UMN;16558', '00;10;1.1;0') to ('262686;M;44;MAR;SPC;31176', '00;6;1.5;0')
Data columns (total 1 columns):
 #   Column                                                                                                                                                                 Non-Null Count  Dtype
---  ------                                                                                                                                                                 --------------  -----
 0   client_id;gender;age;marital_status;job_position;credit_sum;credit_month;tariff_id;score_shk;education;living_region;monthly_income;credit_count;overdue_credit_count  91940 non-null  object
dtypes: object(1)
memory usage: 4.0+ MB

In [184]:
#credit_test[["client_id","gender","age","marital_status","job_position","credit_sum","credit_month","tariff_id","score_shk","education","living_region","monthly_income","credit_count","overdue_credit_count"]] = #
credit_test_splitted = credit_test["client_id;gender;age;marital_status;job_position;credit_sum;credit_month;tariff_id;score_shk;education;living_region;monthly_income;credit_count;overdue_credit_count"].str.split(";",expand=True)

In [200]:
#credit_test_splitted.info()

In [212]:
credit_test_splitted[["client_id"]] =credit_test_splitted[0].str.split(";",expand=True)
credit_test_splitted.head()

,,0,1,2,3,4,5,client_id
170747;F;48;MAR;UMN;16558,00;10;1.1;0,370409,GRD,ÕÀÊÀÑÈß ÐÅÑÏ,34000,2,0,370409
170748;M;29;MAR;SPC;7028,72;6;1.4;0,377281,SCH,ÎÁË ÊÅÌÅÐÎÂÑÊÀß,19000,3,0,377281
170749;F;20;UNM;SPC;13019,00;10;1.6;0,538515,SCH,ÎÁË ÁÅËÃÎÐÎÄÑÊÀß,25000,1,0,538515
170750;F;41;MAR;SPC;9379,00;10;1.1;0,482520,GRD,ÎÁË ÈÐÊÓÒÑÊÀß,30000,0,0,482520
170751;F;31;MAR;SPC;13990,00;6;1.43;0,485914,GRD,ÎÁË ÊÈÐÎÂÑÊÀß,20000,2,0,485914

In [219]:
credit_test_splitted.columns

Index([0, 1, 2, 3, 4, 5, 'client_id'], dtype='object')

In [235]:
#credit_test_splitted[0]
credit_test_splitted['last'] = credit_test_splitted.apply(lambda row: row[0].split(), axis=1)
credit_test_splitted.head()

,,0,1,2,3,4,5,client_id,first_name,last
170747;F;48;MAR;UMN;16558,00;10;1.1;0,370409,GRD,ÕÀÊÀÑÈß ÐÅÑÏ,34000,2,0,370409,[370409],[370409]
170748;M;29;MAR;SPC;7028,72;6;1.4;0,377281,SCH,ÎÁË ÊÅÌÅÐÎÂÑÊÀß,19000,3,0,377281,[377281],[377281]
170749;F;20;UNM;SPC;13019,00;10;1.6;0,538515,SCH,ÎÁË ÁÅËÃÎÐÎÄÑÊÀß,25000,1,0,538515,[538515],[538515]
170750;F;41;MAR;SPC;9379,00;10;1.1;0,482520,GRD,ÎÁË ÈÐÊÓÒÑÊÀß,30000,0,0,482520,[482520],[482520]
170751;F;31;MAR;SPC;13990,00;6;1.43;0,485914,GRD,ÎÁË ÊÈÐÎÂÑÊÀß,20000,2,0,485914,[485914],[485914]

In [237]:
credit_test_splitted[0].str.split(" " ,expand = True)

                                             0
170747;F;48;MAR;UMN;16558 00;10;1.1;0   370409
170748;M;29;MAR;SPC;7028  72;6;1.4;0    377281
170749;F;20;UNM;SPC;13019 00;10;1.6;0   538515
170750;F;41;MAR;SPC;9379  00;10;1.1;0   482520
170751;F;31;MAR;SPC;13990 00;6;1.43;0   485914
...                                        ...
262682;M;41;MAR;SPC;10114 00;12;1.9;0   347262
262683;M;33;UNM;SPC;14807 00;6;1.6;0    404430
262684;F;25;MAR;SPC;19718 00;10;1.4;0   341982
262685;M;26;UNM;SPC;22258 00;10;1.43;0  698764
262686;M;44;MAR;SPC;31176 00;6;1.5;0    238366

[91940 rows x 1 columns]